    create table employees(
    employee_id int,
    name varchar(20),
    age int,
    department varchar(10),
    salary int,
    email varchar(30),
    years_at_company int
    );

    insert into employees values(101,'Alice',25,'IT',50000,'alice@gmail.com',2)
    insert into employees values(102,'Bob',35,'HR',40000,'bob@yahoo.com',6)
    insert into employees values(103,'Charlie',30,'Finance',55000,'',4)
    insert into employees values(104,'Diana',40,'IT',70000,'diana@gmail.com',10)
    insert into employees values(105,'Evan',29,'Sales',45000,'evan@outlook.com',3)
    insert into employees values(106,'Fiona',22,'IT',65000,'fiona@gmail.com',1)
    insert into employees values(107,'George',45,'Marketing',48000,'george@gmail.com',12)
    insert into employees values(108,'Hannah',28,'HR',47000,'hannah@yahoo.com',5)

--1. Write a query to retrieve all data from a table named employees. 

select * from employees;

employee_id name                 age         department salary      email                          years_at_company
----------- -------------------- ----------- ---------- ----------- ------------------------------ ----------------
        101 Alice                         25 IT               50000 alice@gmail.com                               2
        102 Bob                           35 HR               40000 bob@yahoo.com                                 6
        103 Charlie                       30 Finance          55000                                               4
        104 Diana                         40 IT               70000 diana@gmail.com                              10
        105 Evan                          29 Sales            45000 evan@outlook.com                              3
        106 Fiona                         22 IT               65000 fiona@gmail.com                               1
        107 George                        45 Marketing        48000 george@gmail.com                             12
        108 Hannah                        28 HR               47000 hannah@yahoo.com                              5

--2. Fetch the name, age, and department columns from the employees table. 

select name,age,department from employees

name                 age         department
-------------------- ----------- ----------
Alice                         25 IT        
Bob                           35 HR        
Charlie                       30 Finance   
Diana                         40 IT        
Evan                          29 Sales     
Fiona                         22 IT        
George                        45 Marketing 
Hannah                        28 HR

--3. Retrieve all employees whose age is greater than 30. 

select name,age from employees where age>30

name                 age        
-------------------- -----------
Bob                           35
Diana                         40
George                        45

--4. Find employees who work in the IT department and have a salary greater than 50000. 

select name,salary from employees where department='IT' and salary>50000

name                 salary     
-------------------- -----------
Diana                      70000
Fiona                      65000

--5. Get all employees who work in the HR department or are less than 25 years old. 

select name from employees where department='HR' and age<25

name                
--------------------

--6. Retrieve all employees who do not work in the Finance department. 

select name,department from employees where department!='Finance'

name                 department
-------------------- ----------
Alice                IT        
Bob                  HR        
Diana                IT        
Evan                 Sales     
Fiona                IT        
George               Marketing 
Hannah               HR

-7. Find employees whose names start with the letter 'A'. 

select name from employees where name like 'A%'

name                
--------------------
Alice

--8. Retrieve employees whose email addresses contain the domain gmail.com.

select email from employees where email like '%gmail.com%'

email                         
------------------------------
alice@gmail.com               
diana@gmail.com               
fiona@gmail.com               
george@gmail.com

--9. Fetch the names and salaries of employees sorted by salary in descending order. 
  
  select * from employees order by name,salary desc;

employee_id name                 age         department salary      email                          years_at_company
----------- -------------------- ----------- ---------- ----------- ------------------------------ ----------------
        101 Alice                         25 IT               50000 alice@gmail.com                               2
        102 Bob                           35 HR               40000 bob@yahoo.com                                 6
        103 Charlie                       30 Finance          55000                                               4
        104 Diana                         40 IT               70000 diana@gmail.com                              10
        105 Evan                          29 Sales            45000 evan@outlook.com                              3
        106 Fiona                         22 IT               65000 fiona@gmail.com                               1
        107 George                        45 Marketing        48000 george@gmail.com                             12
        108 Hannah                        28 HR               47000 hannah@yahoo.com                              5

--10. Retrieve the top 5 highest-paid employees. 

select name,department,salary from employees order by salary desc limit 5 ;

name                 department salary     
-------------------- ---------- -----------
Diana                IT               70000
Fiona                IT               65000
Charlie              Finance          55000
Alice                IT               50000
George               Marketing        48000

--11. Count the total number of employees in the employees table. 

select Count(*) from employees;

----------
          8

--12. Write a query to find the minimum and maximum salaries in the employees table.

select min(salary) from employees

select max(salary) from employees

-----------
      40000
           
-----------
      70000

--13. Calculate the average salary of employees in each department. 

select department , avg(salary) as average_salary from employees group by department;

department average_salary
---------- --------------
Finance             55000
HR                  43500
IT                  61666
Marketing           48000
Sales               45000

-14. Find all employees who work in the IT department and have a salary greater than 60000 or have been with the company for more than 5 years

select * from employees  where department='IT' and (salary > 60000 or years_at_company>5 );

employee_id name                 age         department salary      email                          years_at_company
----------- -------------------- ----------- ---------- ----------- ------------------------------ ----------------
        104 Diana                         40 IT               70000 diana@gmail.com                              10
        106 Fiona                         22 IT               65000 fiona@gmail.com                               1

--15. Increase the salary of all employees in the Sales department by 10%.

update employees set salary=salary*1.10 where department='Sales';

--16. Update the department of an employee with employee_id = 101 to Marketing.

Update employees set department='Marketing' where employee_id=101

employee_id name                 age         department salary      email                          years_at_company
----------- -------------------- ----------- ---------- ----------- ------------------------------ ----------------
        101 Alice                         25 Marketing        50000 alice@gmail.com                               2
        102 Bob                           35 HR               40000 bob@yahoo.com                                 6
        103 Charlie                       30 Finance          55000                                               4
        104 Diana                         40 IT               70000 diana@gmail.com                              10
        105 Evan                          29 Sales            49500 evan@outlook.com                              3
        106 Fiona                         22 IT               65000 fiona@gmail.com                               1
        107 George                        45 Marketing        48000 george@gmail.com                             12
        108 Hannah                        28 HR               47000 hannah@yahoo.com                              5